---
kind: type
id: T:Autodesk.Revit.DB.Lighting.BasicLossFactor
source: html/4ae30f40-0afb-176a-1b90-61ac2ac2727f.htm
---
# Autodesk.Revit.DB.Lighting.BasicLossFactor

This class encapsulates basic lighting loss factor calculation.

## Syntax (C#)
```csharp
public class BasicLossFactor : LossFactor
```